# Код Морзе для представления цифр и букв использует тире и точки. Напишите
# функцию для кодирования текстового сообщения в соответствии с кодом Морзе.


MORS_ENG = {'A': '.-', 'B': '-...', 'C': '-.-.', 'D': '-..', 'E': '.', 'F': '..-.', 'G': '--.', 'H': '....',
            'I': '..', 'J': '.---', 'K': '-.-', 'L': '.-..', 'M': '--', 'N': '-.', 'O': '---', 'P': '.--.',
            'Q': '--.-', 'R': '.-.', 'S': '...', 'T': '-', 'U': '..-', 'V': '...-', 'W': '.--', 'X': '-..-',
            'Y': '-.--', 'Z': '--..', '0': '-----', '1': '.----', '2': '..---', '3': '...--', '4': '....-',
            '5': '.....', '6': '-....', '7': '--...', '8': '---..', '9': '----.'}

MORS_RUS = {'А': '.-', 'Б': '-...', 'Ц': '-.-.', 'Д': '-..', 'Е': '.', 'Ф': '..-.', 'Г': '--.', 'Х': '....',
            'И': '..', 'Й': '.---', 'К': '-.-', 'Л': '.-..', 'М': '--', 'Н': '-.', 'О': '---', 'П': '.--.',
            'O': '--.-', 'Р': '.-.', 'С': '...', 'Т': '-', 'У': '..-', 'Ж': '...-', 'В': '.--', 'Ы': '-..-',
            'Ь': '-.--', 'З': '--..', 'Ч': '---.', 'Ш': '----', 'Э': '..-..', 'Ю': '..--', 'Я': '.-.-',
            '0': '-----', '1': '.----', '2': '..---', '3': '...--', '4': '....-', '5': '.....', '6': '-....',
            '7': '--...', '8': '---..', '9': '----.', }


def en_mors(text):
    mors = []
    for i in text:
        if i in MORS_ENG:
            mors.append(MORS_ENG[i])
    return " ".join(mors)


def rus_mors(text):
    mors = []
    for i in text:
        if i in MORS_RUS:
            mors.append(MORS_RUS[i])
    return " ".join(mors)


def main():
    while True:
        res = input("Please select your language:\n English (1) \n Русский (2) \n >>> ").upper()
        if res == "1" or res == "2":
            break

    if res == "1":
        print("Enter English text: ")
        english = input("> ").upper()
        mors = en_mors(english)
        print("### English version ###")
        print(mors)

    elif res == "2":
        print("Введите русский текст: ")
        russian = input("> ").upper()
        mors = rus_mors(russian)
        print("### русская версия ###")
        print(mors)


if __name__ == "__main__":
    main()
